FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_pwm.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_PWM_COMPONENT_
#define _SAMV71_PWM_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Pulse Width Modulation Controller */
/* ============================================================================= */
/** \addtogroup SAMV71_PWM Pulse Width Modulation Controller */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief PwmCh_num hardware registers */
    typedef struct
    {
        __IO uint32_t PWM_CMR;    /**< \brief (PwmCh_num Offset: 0x0) PWM Channel Mode Register */
        __IO uint32_t PWM_CDTY;   /**< \brief (PwmCh_num Offset: 0x4) PWM Channel Duty Cycle Register */
        __O uint32_t PWM_CDTYUPD; /**< \brief (PwmCh_num Offset: 0x8) PWM Channel Duty Cycle Update Register */
        __IO uint32_t PWM_CPRD;   /**< \brief (PwmCh_num Offset: 0xC) PWM Channel Period Register */
        __O uint32_t PWM_CPRDUPD; /**< \brief (PwmCh_num Offset: 0x10) PWM Channel Period Update Register */
        __I uint32_t PWM_CCNT;    /**< \brief (PwmCh_num Offset: 0x14) PWM Channel Counter Register */
        __IO uint32_t PWM_DT;     /**< \brief (PwmCh_num Offset: 0x18) PWM Channel Dead Time Register */
        __O uint32_t PWM_DTUPD;   /**< \brief (PwmCh_num Offset: 0x1C) PWM Channel Dead Time Update Register */
    } PwmCh_num;
/** \brief PwmCmp hardware registers */
    typedef struct
    {
        __IO uint32_t PWM_CMPV;   /**< \brief (PwmCmp Offset: 0x0) PWM Comparison 0 Value Register */
        __O uint32_t PWM_CMPVUPD; /**< \brief (PwmCmp Offset: 0x4) PWM Comparison 0 Value Update Register */
        __IO uint32_t PWM_CMPM;   /**< \brief (PwmCmp Offset: 0x8) PWM Comparison 0 Mode Register */
        __O uint32_t PWM_CMPMUPD; /**< \brief (PwmCmp Offset: 0xC) PWM Comparison 0 Mode Update Register */
    } PwmCmp;
/** \brief Pwm hardware registers */
    #define PWMCMP_NUMBER       8
    #define PWMCH_NUM_NUMBER    4
    typedef struct
    {
        __IO uint32_t PWM_CLK;                    /**< \brief (Pwm Offset: 0x00) PWM Clock Register */
        __O uint32_t PWM_ENA;                     /**< \brief (Pwm Offset: 0x04) PWM Enable Register */
        __O uint32_t PWM_DIS;                     /**< \brief (Pwm Offset: 0x08) PWM Disable Register */
        __I uint32_t PWM_SR;                      /**< \brief (Pwm Offset: 0x0C) PWM Status Register */
        __O uint32_t PWM_IER1;                    /**< \brief (Pwm Offset: 0x10) PWM Interrupt Enable Register 1 */
        __O uint32_t PWM_IDR1;                    /**< \brief (Pwm Offset: 0x14) PWM Interrupt Disable Register 1 */
        __I uint32_t PWM_IMR1;                    /**< \brief (Pwm Offset: 0x18) PWM Interrupt Mask Register 1 */
        __I uint32_t PWM_ISR1;                    /**< \brief (Pwm Offset: 0x1C) PWM Interrupt Status Register 1 */
        __IO uint32_t PWM_SCM;                    /**< \brief (Pwm Offset: 0x20) PWM Sync Channels Mode Register */
        __O uint32_t PWM_DMAR;                    /**< \brief (Pwm Offset: 0x24) PWM DMA Register */
        __IO uint32_t PWM_SCUC;                   /**< \brief (Pwm Offset: 0x28) PWM Sync Channels Update Control Register */
        __IO uint32_t PWM_SCUP;                   /**< \brief (Pwm Offset: 0x2C) PWM Sync Channels Update Period Register */
        __O uint32_t PWM_SCUPUPD;                 /**< \brief (Pwm Offset: 0x30) PWM Sync Channels Update Period Update Register */
        __O uint32_t PWM_IER2;                    /**< \brief (Pwm Offset: 0x34) PWM Interrupt Enable Register 2 */
        __O uint32_t PWM_IDR2;                    /**< \brief (Pwm Offset: 0x38) PWM Interrupt Disable Register 2 */
        __I uint32_t PWM_IMR2;                    /**< \brief (Pwm Offset: 0x3C) PWM Interrupt Mask Register 2 */
        __I uint32_t PWM_ISR2;                    /**< \brief (Pwm Offset: 0x40) PWM Interrupt Status Register 2 */
        __IO uint32_t PWM_OOV;                    /**< \brief (Pwm Offset: 0x44) PWM Output Override Value Register */
        __IO uint32_t PWM_OS;                     /**< \brief (Pwm Offset: 0x48) PWM Output Selection Register */
        __O uint32_t PWM_OSS;                     /**< \brief (Pwm Offset: 0x4C) PWM Output Selection Set Register */
        __O uint32_t PWM_OSC;                     /**< \brief (Pwm Offset: 0x50) PWM Output Selection Clear Register */
        __O uint32_t PWM_OSSUPD;                  /**< \brief (Pwm Offset: 0x54) PWM Output Selection Set Update Register */
        __O uint32_t PWM_OSCUPD;                  /**< \brief (Pwm Offset: 0x58) PWM Output Selection Clear Update Register */
        __IO uint32_t PWM_FMR;                    /**< \brief (Pwm Offset: 0x5C) PWM Fault Mode Register */
        __I uint32_t PWM_FSR;                     /**< \brief (Pwm Offset: 0x60) PWM Fault Status Register */
        __O uint32_t PWM_FCR;                     /**< \brief (Pwm Offset: 0x64) PWM Fault Clear Register */
        __IO uint32_t PWM_FPV1;                   /**< \brief (Pwm Offset: 0x68) PWM Fault Protection Value Register 1 */
        __IO uint32_t PWM_FPE;                    /**< \brief (Pwm Offset: 0x6C) PWM Fault Protection Enable Register */
        __I uint32_t Reserved1[ 3 ];
        __IO uint32_t PWM_ELMR[ 8 ];              /**< \brief (Pwm Offset: 0x7C) PWM Event Line 0 Mode Register */
        __I uint32_t Reserved2[ 1 ];
        __IO uint32_t PWM_SSPR;                   /**< \brief (Pwm Offset: 0xA0) PWM Spread Spectrum Register */
        __O uint32_t PWM_SSPUP;                   /**< \brief (Pwm Offset: 0xA4) PWM Spread Spectrum Update Register */
        __I uint32_t Reserved3[ 2 ];
        __IO uint32_t PWM_SMMR;                   /**< \brief (Pwm Offset: 0xB0) PWM Stepper Motor Mode Register */
        __I uint32_t Reserved4[ 3 ];
        __IO uint32_t PWM_FPV2;                   /**< \brief (Pwm Offset: 0xC0) PWM Fault Protection Value 2 Register */
        __I uint32_t Reserved5[ 8 ];
        __O uint32_t PWM_WPCR;                    /**< \brief (Pwm Offset: 0xE4) PWM Write Protection Control Register */
        __I uint32_t PWM_WPSR;                    /**< \brief (Pwm Offset: 0xE8) PWM Write Protection Status Register */
        __I uint32_t Reserved6[ 17 ];
        PwmCmp PWM_CMP[ PWMCMP_NUMBER ];          /**< \brief (Pwm Offset: 0x130) 0 .. 7 */
        __I uint32_t Reserved7[ 20 ];
        PwmCh_num PWM_CH_NUM[ PWMCH_NUM_NUMBER ]; /**< \brief (Pwm Offset: 0x200) ch_num = 0 .. 3 */
        __I uint32_t Reserved8[ 96 ];
        __O uint32_t PWM_CMUPD0;                  /**< \brief (Pwm Offset: 0x400) PWM Channel Mode Update Register (ch_num = 0) */
        __I uint32_t Reserved9[ 7 ];
        __O uint32_t PWM_CMUPD1;                  /**< \brief (Pwm Offset: 0x420) PWM Channel Mode Update Register (ch_num = 1) */
        __I uint32_t Reserved10[ 2 ];
        __IO uint32_t PWM_ETRG1;                  /**< \brief (Pwm Offset: 0x42C) PWM External Trigger Register (trg_num = 1) */
        __IO uint32_t PWM_LEBR1;                  /**< \brief (Pwm Offset: 0x430) PWM Leading-Edge Blanking Register (trg_num = 1) */
        __I uint32_t Reserved11[ 3 ];
        __O uint32_t PWM_CMUPD2;                  /**< \brief (Pwm Offset: 0x440) PWM Channel Mode Update Register (ch_num = 2) */
        __I uint32_t Reserved12[ 2 ];
        __IO uint32_t PWM_ETRG2;                  /**< \brief (Pwm Offset: 0x44C) PWM External Trigger Register (trg_num = 2) */
        __IO uint32_t PWM_LEBR2;                  /**< \brief (Pwm Offset: 0x450) PWM Leading-Edge Blanking Register (trg_num = 2) */
        __I uint32_t Reserved13[ 3 ];
        __O uint32_t PWM_CMUPD3;                  /**< \brief (Pwm Offset: 0x460) PWM Channel Mode Update Register (ch_num = 3) */
        __I uint32_t Reserved14[ 2 ];
        __IO uint32_t PWM_ETRG3;                  /**< \brief (Pwm Offset: 0x46C) PWM External Trigger Register (trg_num = 3) */
        __IO uint32_t PWM_LEBR3;                  /**< \brief (Pwm Offset: 0x470) PWM Leading-Edge Blanking Register (trg_num = 3) */
        __I uint32_t Reserved15[ 6 ];
        __IO uint32_t PWM_ETRG4;                  /**< \brief (Pwm Offset: 0x48C) PWM External Trigger Register (trg_num = 4) */
        __IO uint32_t PWM_LEBR4;                  /**< \brief (Pwm Offset: 0x490) PWM Leading-Edge Blanking Register (trg_num = 4) */
    } Pwm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- PWM_CLK : (PWM Offset: 0x00) PWM Clock Register -------- */
#define PWM_CLK_DIVA_Pos                    0
#define PWM_CLK_DIVA_Msk                    ( 0xffu << PWM_CLK_DIVA_Pos ) /**< \brief (PWM_CLK) CLKA Divide Factor */
#define PWM_CLK_DIVA( value )    ( ( PWM_CLK_DIVA_Msk & ( ( value ) << PWM_CLK_DIVA_Pos ) ) )
#define   PWM_CLK_DIVA_CLKA_POFF            ( 0x0u << 0 )                 /**< \brief (PWM_CLK) CLKA clock is turned off */
#define   PWM_CLK_DIVA_PREA                 ( 0x1u << 0 )                 /**< \brief (PWM_CLK) CLKA clock is clock selected by PREA */
#define PWM_CLK_PREA_Pos                    8
#define PWM_CLK_PREA_Msk                    ( 0xfu << PWM_CLK_PREA_Pos )  /**< \brief (PWM_CLK) CLKA Source Clock Selection */
#define PWM_CLK_PREA( value )    ( ( PWM_CLK_PREA_Msk & ( ( value ) << PWM_CLK_PREA_Pos ) ) )
#define   PWM_CLK_PREA_CLK                  ( 0x0u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock */
#define   PWM_CLK_PREA_CLK_DIV2             ( 0x1u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/2 */
#define   PWM_CLK_PREA_CLK_DIV4             ( 0x2u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/4 */
#define   PWM_CLK_PREA_CLK_DIV8             ( 0x3u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/8 */
#define   PWM_CLK_PREA_CLK_DIV16            ( 0x4u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/16 */
#define   PWM_CLK_PREA_CLK_DIV32            ( 0x5u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/32 */
#define   PWM_CLK_PREA_CLK_DIV64            ( 0x6u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/64 */
#define   PWM_CLK_PREA_CLK_DIV128           ( 0x7u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/128 */
#define   PWM_CLK_PREA_CLK_DIV256           ( 0x8u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/256 */
#define   PWM_CLK_PREA_CLK_DIV512           ( 0x9u << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/512 */
#define   PWM_CLK_PREA_CLK_DIV1024          ( 0xAu << 8 )                 /**< \brief (PWM_CLK) Peripheral clock/1024 */
#define PWM_CLK_DIVB_Pos                    16
#define PWM_CLK_DIVB_Msk                    ( 0xffu << PWM_CLK_DIVB_Pos ) /**< \brief (PWM_CLK) CLKB Divide Factor */
#define PWM_CLK_DIVB( value )    ( ( PWM_CLK_DIVB_Msk & ( ( value ) << PWM_CLK_DIVB_Pos ) ) )
#define   PWM_CLK_DIVB_CLKB_POFF            ( 0x0u << 16 )                /**< \brief (PWM_CLK) CLKB clock is turned off */
#define   PWM_CLK_DIVB_PREB                 ( 0x1u << 16 )                /**< \brief (PWM_CLK) CLKB clock is clock selected by PREB */
#define PWM_CLK_PREB_Pos                    24
#define PWM_CLK_PREB_Msk                    ( 0xfu << PWM_CLK_PREB_Pos )  /**< \brief (PWM_CLK) CLKB Source Clock Selection */
#define PWM_CLK_PREB( value )    ( ( PWM_CLK_PREB_Msk & ( ( value ) << PWM_CLK_PREB_Pos ) ) )
#define   PWM_CLK_PREB_CLK                  ( 0x0u << 24 )                /**< \brief (PWM_CLK) Peripheral clock */
#define   PWM_CLK_PREB_CLK_DIV2             ( 0x1u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/2 */
#define   PWM_CLK_PREB_CLK_DIV4             ( 0x2u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/4 */
#define   PWM_CLK_PREB_CLK_DIV8             ( 0x3u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/8 */
#define   PWM_CLK_PREB_CLK_DIV16            ( 0x4u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/16 */
#define   PWM_CLK_PREB_CLK_DIV32            ( 0x5u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/32 */
#define   PWM_CLK_PREB_CLK_DIV64            ( 0x6u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/64 */
#define   PWM_CLK_PREB_CLK_DIV128           ( 0x7u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/128 */
#define   PWM_CLK_PREB_CLK_DIV256           ( 0x8u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/256 */
#define   PWM_CLK_PREB_CLK_DIV512           ( 0x9u << 24 )                /**< \brief (PWM_CLK) Peripheral clock/512 */
#define   PWM_CLK_PREB_CLK_DIV1024          ( 0xAu << 24 )                /**< \brief (PWM_CLK) Peripheral clock/1024 */
/* -------- PWM_ENA : (PWM Offset: 0x04) PWM Enable Register -------- */
#define PWM_ENA_CHID0                       ( 0x1u << 0 )                 /**< \brief (PWM_ENA) Channel ID */
#define PWM_ENA_CHID1                       ( 0x1u << 1 )                 /**< \brief (PWM_ENA) Channel ID */
#define PWM_ENA_CHID2                       ( 0x1u << 2 )                 /**< \brief (PWM_ENA) Channel ID */
#define PWM_ENA_CHID3                       ( 0x1u << 3 )                 /**< \brief (PWM_ENA) Channel ID */
/* -------- PWM_DIS : (PWM Offset: 0x08) PWM Disable Register -------- */
#define PWM_DIS_CHID0                       ( 0x1u << 0 )                 /**< \brief (PWM_DIS) Channel ID */
#define PWM_DIS_CHID1                       ( 0x1u << 1 )                 /**< \brief (PWM_DIS) Channel ID */
#define PWM_DIS_CHID2                       ( 0x1u << 2 )                 /**< \brief (PWM_DIS) Channel ID */
#define PWM_DIS_CHID3                       ( 0x1u << 3 )                 /**< \brief (PWM_DIS) Channel ID */
/* -------- PWM_SR : (PWM Offset: 0x0C) PWM Status Register -------- */
#define PWM_SR_CHID0                        ( 0x1u << 0 )                 /**< \brief (PWM_SR) Channel ID */
#define PWM_SR_CHID1                        ( 0x1u << 1 )                 /**< \brief (PWM_SR) Channel ID */
#define PWM_SR_CHID2                        ( 0x1u << 2 )                 /**< \brief (PWM_SR) Channel ID */
#define PWM_SR_CHID3                        ( 0x1u << 3 )                 /**< \brief (PWM_SR) Channel ID */
/* -------- PWM_IER1 : (PWM Offset: 0x10) PWM Interrupt Enable Register 1 -------- */
#define PWM_IER1_CHID0                      ( 0x1u << 0 )                 /**< \brief (PWM_IER1) Counter Event on Channel 0 Interrupt Enable */
#define PWM_IER1_CHID1                      ( 0x1u << 1 )                 /**< \brief (PWM_IER1) Counter Event on Channel 1 Interrupt Enable */
#define PWM_IER1_CHID2                      ( 0x1u << 2 )                 /**< \brief (PWM_IER1) Counter Event on Channel 2 Interrupt Enable */
#define PWM_IER1_CHID3                      ( 0x1u << 3 )                 /**< \brief (PWM_IER1) Counter Event on Channel 3 Interrupt Enable */
#define PWM_IER1_FCHID0                     ( 0x1u << 16 )                /**< \brief (PWM_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable */
#define PWM_IER1_FCHID1                     ( 0x1u << 17 )                /**< \brief (PWM_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable */
#define PWM_IER1_FCHID2                     ( 0x1u << 18 )                /**< \brief (PWM_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable */
#define PWM_IER1_FCHID3                     ( 0x1u << 19 )                /**< \brief (PWM_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable */
/* -------- PWM_IDR1 : (PWM Offset: 0x14) PWM Interrupt Disable Register 1 -------- */
#define PWM_IDR1_CHID0                      ( 0x1u << 0 )                 /**< \brief (PWM_IDR1) Counter Event on Channel 0 Interrupt Disable */
#define PWM_IDR1_CHID1                      ( 0x1u << 1 )                 /**< \brief (PWM_IDR1) Counter Event on Channel 1 Interrupt Disable */
#define PWM_IDR1_CHID2                      ( 0x1u << 2 )                 /**< \brief (PWM_IDR1) Counter Event on Channel 2 Interrupt Disable */
#define PWM_IDR1_CHID3                      ( 0x1u << 3 )                 /**< \brief (PWM_IDR1) Counter Event on Channel 3 Interrupt Disable */
#define PWM_IDR1_FCHID0                     ( 0x1u << 16 )                /**< \brief (PWM_IDR1) Fault Protection Trigger on Channel 0 Interrupt Disable */
#define PWM_IDR1_FCHID1                     ( 0x1u << 17 )                /**< \brief (PWM_IDR1) Fault Protection Trigger on Channel 1 Interrupt Disable */
#define PWM_IDR1_FCHID2                     ( 0x1u << 18 )                /**< \brief (PWM_IDR1) Fault Protection Trigger on Channel 2 Interrupt Disable */
#define PWM_IDR1_FCHID3                     ( 0x1u << 19 )                /**< \brief (PWM_IDR1) Fault Protection Trigger on Channel 3 Interrupt Disable */
/* -------- PWM_IMR1 : (PWM Offset: 0x18) PWM Interrupt Mask Register 1 -------- */
#define PWM_IMR1_CHID0                      ( 0x1u << 0 )                 /**< \brief (PWM_IMR1) Counter Event on Channel 0 Interrupt Mask */
#define PWM_IMR1_CHID1                      ( 0x1u << 1 )                 /**< \brief (PWM_IMR1) Counter Event on Channel 1 Interrupt Mask */
#define PWM_IMR1_CHID2                      ( 0x1u << 2 )                 /**< \brief (PWM_IMR1) Counter Event on Channel 2 Interrupt Mask */
#define PWM_IMR1_CHID3                      ( 0x1u << 3 )                 /**< \brief (PWM_IMR1) Counter Event on Channel 3 Interrupt Mask */
#define PWM_IMR1_FCHID0                     ( 0x1u << 16 )                /**< \brief (PWM_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask */
#define PWM_IMR1_FCHID1                     ( 0x1u << 17 )                /**< \brief (PWM_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask */
#define PWM_IMR1_FCHID2                     ( 0x1u << 18 )                /**< \brief (PWM_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask */
#define PWM_IMR1_FCHID3                     ( 0x1u << 19 )                /**< \brief (PWM_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask */
/* -------- PWM_ISR1 : (PWM Offset: 0x1C) PWM Interrupt Status Register 1 -------- */
#define PWM_ISR1_CHID0                      ( 0x1u << 0 )                 /**< \brief (PWM_ISR1) Counter Event on Channel 0 */
#define PWM_ISR1_CHID1                      ( 0x1u << 1 )                 /**< \brief (PWM_ISR1) Counter Event on Channel 1 */
#define PWM_ISR1_CHID2                      ( 0x1u << 2 )                 /**< \brief (PWM_ISR1) Counter Event on Channel 2 */
#define PWM_ISR1_CHID3                      ( 0x1u << 3 )                 /**< \brief (PWM_ISR1) Counter Event on Channel 3 */
#define PWM_ISR1_FCHID0                     ( 0x1u << 16 )                /**< \brief (PWM_ISR1) Fault Protection Trigger on Channel 0 */
#define PWM_ISR1_FCHID1                     ( 0x1u << 17 )                /**< \brief (PWM_ISR1) Fault Protection Trigger on Channel 1 */
#define PWM_ISR1_FCHID2                     ( 0x1u << 18 )                /**< \brief (PWM_ISR1) Fault Protection Trigger on Channel 2 */
#define PWM_ISR1_FCHID3                     ( 0x1u << 19 )                /**< \brief (PWM_ISR1) Fault Protection Trigger on Channel 3 */
/* -------- PWM_SCM : (PWM Offset: 0x20) PWM Sync Channels Mode Register -------- */
#define PWM_SCM_SYNC0                       ( 0x1u << 0 )                 /**< \brief (PWM_SCM) Synchronous Channel 0 */
#define PWM_SCM_SYNC1                       ( 0x1u << 1 )                 /**< \brief (PWM_SCM) Synchronous Channel 1 */
#define PWM_SCM_SYNC2                       ( 0x1u << 2 )                 /**< \brief (PWM_SCM) Synchronous Channel 2 */
#define PWM_SCM_SYNC3                       ( 0x1u << 3 )                 /**< \brief (PWM_SCM) Synchronous Channel 3 */
#define PWM_SCM_UPDM_Pos                    16
#define PWM_SCM_UPDM_Msk                    ( 0x3u << PWM_SCM_UPDM_Pos )  /**< \brief (PWM_SCM) Synchronous Channels Update Mode */
#define PWM_SCM_UPDM( value )    ( ( PWM_SCM_UPDM_Msk & ( ( value ) << PWM_SCM_UPDM_Pos ) ) )
#define   PWM_SCM_UPDM_MODE0                ( 0x0u << 16 )                /**< \brief (PWM_SCM) Manual write of double buffer registers and manual update of synchronous channels */
#define   PWM_SCM_UPDM_MODE1                ( 0x1u << 16 )                /**< \brief (PWM_SCM) Manual write of double buffer registers and automatic update of synchronous channels */
#define   PWM_SCM_UPDM_MODE2                ( 0x2u << 16 )                /**< \brief (PWM_SCM) Automatic write of duty-cycle update registers by the DMA and automatic update of synchronous channels */
#define PWM_SCM_PTRM                        ( 0x1u << 20 )                /**< \brief (PWM_SCM) DMA Transfer Request Mode */
#define PWM_SCM_PTRCS_Pos                   21
#define PWM_SCM_PTRCS_Msk                   ( 0x7u << PWM_SCM_PTRCS_Pos ) /**< \brief (PWM_SCM) DMA Transfer Request Comparison Selection */
#define PWM_SCM_PTRCS( value )    ( ( PWM_SCM_PTRCS_Msk & ( ( value ) << PWM_SCM_PTRCS_Pos ) ) )
/* -------- PWM_DMAR : (PWM Offset: 0x24) PWM DMA Register -------- */
#define PWM_DMAR_DMADUTY_Pos                0
#define PWM_DMAR_DMADUTY_Msk                ( 0xffffffu << PWM_DMAR_DMADUTY_Pos ) /**< \brief (PWM_DMAR) Duty-Cycle Holding Register for DMA Access */
#define PWM_DMAR_DMADUTY( value )    ( ( PWM_DMAR_DMADUTY_Msk & ( ( value ) << PWM_DMAR_DMADUTY_Pos ) ) )
/* -------- PWM_SCUC : (PWM Offset: 0x28) PWM Sync Channels Update Control Register -------- */
#define PWM_SCUC_UPDULOCK                   ( 0x1u << 0 ) /**< \brief (PWM_SCUC) Synchronous Channels Update Unlock */
