FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_pwm.h
/* -------- PWM_SCUP : (PWM Offset: 0x2C) PWM Sync Channels Update Period Register -------- */
#define PWM_SCUP_UPR_Pos                    0
#define PWM_SCUP_UPR_Msk                    ( 0xfu << PWM_SCUP_UPR_Pos ) /**< \brief (PWM_SCUP) Update Period */
#define PWM_SCUP_UPR( value )       ( ( PWM_SCUP_UPR_Msk & ( ( value ) << PWM_SCUP_UPR_Pos ) ) )
#define PWM_SCUP_UPRCNT_Pos                 4
#define PWM_SCUP_UPRCNT_Msk                 ( 0xfu << PWM_SCUP_UPRCNT_Pos ) /**< \brief (PWM_SCUP) Update Period Counter */
#define PWM_SCUP_UPRCNT( value )    ( ( PWM_SCUP_UPRCNT_Msk & ( ( value ) << PWM_SCUP_UPRCNT_Pos ) ) )
/* -------- PWM_SCUPUPD : (PWM Offset: 0x30) PWM Sync Channels Update Period Update Register -------- */
#define PWM_SCUPUPD_UPRUPD_Pos              0
#define PWM_SCUPUPD_UPRUPD_Msk              ( 0xfu << PWM_SCUPUPD_UPRUPD_Pos ) /**< \brief (PWM_SCUPUPD) Update Period Update */
#define PWM_SCUPUPD_UPRUPD( value )    ( ( PWM_SCUPUPD_UPRUPD_Msk & ( ( value ) << PWM_SCUPUPD_UPRUPD_Pos ) ) )
/* -------- PWM_IER2 : (PWM Offset: 0x34) PWM Interrupt Enable Register 2 -------- */
#define PWM_IER2_WRDY                       ( 0x1u << 0 )  /**< \brief (PWM_IER2) Write Ready for Synchronous Channels Update Interrupt Enable */
#define PWM_IER2_UNRE                       ( 0x1u << 3 )  /**< \brief (PWM_IER2) Synchronous Channels Update Underrun Error Interrupt Enable */
#define PWM_IER2_CMPM0                      ( 0x1u << 8 )  /**< \brief (PWM_IER2) Comparison 0 Match Interrupt Enable */
#define PWM_IER2_CMPM1                      ( 0x1u << 9 )  /**< \brief (PWM_IER2) Comparison 1 Match Interrupt Enable */
#define PWM_IER2_CMPM2                      ( 0x1u << 10 ) /**< \brief (PWM_IER2) Comparison 2 Match Interrupt Enable */
#define PWM_IER2_CMPM3                      ( 0x1u << 11 ) /**< \brief (PWM_IER2) Comparison 3 Match Interrupt Enable */
#define PWM_IER2_CMPM4                      ( 0x1u << 12 ) /**< \brief (PWM_IER2) Comparison 4 Match Interrupt Enable */
#define PWM_IER2_CMPM5                      ( 0x1u << 13 ) /**< \brief (PWM_IER2) Comparison 5 Match Interrupt Enable */
#define PWM_IER2_CMPM6                      ( 0x1u << 14 ) /**< \brief (PWM_IER2) Comparison 6 Match Interrupt Enable */
#define PWM_IER2_CMPM7                      ( 0x1u << 15 ) /**< \brief (PWM_IER2) Comparison 7 Match Interrupt Enable */
#define PWM_IER2_CMPU0                      ( 0x1u << 16 ) /**< \brief (PWM_IER2) Comparison 0 Update Interrupt Enable */
#define PWM_IER2_CMPU1                      ( 0x1u << 17 ) /**< \brief (PWM_IER2) Comparison 1 Update Interrupt Enable */
#define PWM_IER2_CMPU2                      ( 0x1u << 18 ) /**< \brief (PWM_IER2) Comparison 2 Update Interrupt Enable */
#define PWM_IER2_CMPU3                      ( 0x1u << 19 ) /**< \brief (PWM_IER2) Comparison 3 Update Interrupt Enable */
#define PWM_IER2_CMPU4                      ( 0x1u << 20 ) /**< \brief (PWM_IER2) Comparison 4 Update Interrupt Enable */
#define PWM_IER2_CMPU5                      ( 0x1u << 21 ) /**< \brief (PWM_IER2) Comparison 5 Update Interrupt Enable */
#define PWM_IER2_CMPU6                      ( 0x1u << 22 ) /**< \brief (PWM_IER2) Comparison 6 Update Interrupt Enable */
#define PWM_IER2_CMPU7                      ( 0x1u << 23 ) /**< \brief (PWM_IER2) Comparison 7 Update Interrupt Enable */
/* -------- PWM_IDR2 : (PWM Offset: 0x38) PWM Interrupt Disable Register 2 -------- */
#define PWM_IDR2_WRDY                       ( 0x1u << 0 )  /**< \brief (PWM_IDR2) Write Ready for Synchronous Channels Update Interrupt Disable */
#define PWM_IDR2_UNRE                       ( 0x1u << 3 )  /**< \brief (PWM_IDR2) Synchronous Channels Update Underrun Error Interrupt Disable */
#define PWM_IDR2_CMPM0                      ( 0x1u << 8 )  /**< \brief (PWM_IDR2) Comparison 0 Match Interrupt Disable */
#define PWM_IDR2_CMPM1                      ( 0x1u << 9 )  /**< \brief (PWM_IDR2) Comparison 1 Match Interrupt Disable */
#define PWM_IDR2_CMPM2                      ( 0x1u << 10 ) /**< \brief (PWM_IDR2) Comparison 2 Match Interrupt Disable */
#define PWM_IDR2_CMPM3                      ( 0x1u << 11 ) /**< \brief (PWM_IDR2) Comparison 3 Match Interrupt Disable */
#define PWM_IDR2_CMPM4                      ( 0x1u << 12 ) /**< \brief (PWM_IDR2) Comparison 4 Match Interrupt Disable */
#define PWM_IDR2_CMPM5                      ( 0x1u << 13 ) /**< \brief (PWM_IDR2) Comparison 5 Match Interrupt Disable */
#define PWM_IDR2_CMPM6                      ( 0x1u << 14 ) /**< \brief (PWM_IDR2) Comparison 6 Match Interrupt Disable */
#define PWM_IDR2_CMPM7                      ( 0x1u << 15 ) /**< \brief (PWM_IDR2) Comparison 7 Match Interrupt Disable */
#define PWM_IDR2_CMPU0                      ( 0x1u << 16 ) /**< \brief (PWM_IDR2) Comparison 0 Update Interrupt Disable */
#define PWM_IDR2_CMPU1                      ( 0x1u << 17 ) /**< \brief (PWM_IDR2) Comparison 1 Update Interrupt Disable */
#define PWM_IDR2_CMPU2                      ( 0x1u << 18 ) /**< \brief (PWM_IDR2) Comparison 2 Update Interrupt Disable */
#define PWM_IDR2_CMPU3                      ( 0x1u << 19 ) /**< \brief (PWM_IDR2) Comparison 3 Update Interrupt Disable */
#define PWM_IDR2_CMPU4                      ( 0x1u << 20 ) /**< \brief (PWM_IDR2) Comparison 4 Update Interrupt Disable */
#define PWM_IDR2_CMPU5                      ( 0x1u << 21 ) /**< \brief (PWM_IDR2) Comparison 5 Update Interrupt Disable */
#define PWM_IDR2_CMPU6                      ( 0x1u << 22 ) /**< \brief (PWM_IDR2) Comparison 6 Update Interrupt Disable */
#define PWM_IDR2_CMPU7                      ( 0x1u << 23 ) /**< \brief (PWM_IDR2) Comparison 7 Update Interrupt Disable */
/* -------- PWM_IMR2 : (PWM Offset: 0x3C) PWM Interrupt Mask Register 2 -------- */
#define PWM_IMR2_WRDY                       ( 0x1u << 0 )  /**< \brief (PWM_IMR2) Write Ready for Synchronous Channels Update Interrupt Mask */
#define PWM_IMR2_UNRE                       ( 0x1u << 3 )  /**< \brief (PWM_IMR2) Synchronous Channels Update Underrun Error Interrupt Mask */
#define PWM_IMR2_CMPM0                      ( 0x1u << 8 )  /**< \brief (PWM_IMR2) Comparison 0 Match Interrupt Mask */
#define PWM_IMR2_CMPM1                      ( 0x1u << 9 )  /**< \brief (PWM_IMR2) Comparison 1 Match Interrupt Mask */
#define PWM_IMR2_CMPM2                      ( 0x1u << 10 ) /**< \brief (PWM_IMR2) Comparison 2 Match Interrupt Mask */
#define PWM_IMR2_CMPM3                      ( 0x1u << 11 ) /**< \brief (PWM_IMR2) Comparison 3 Match Interrupt Mask */
#define PWM_IMR2_CMPM4                      ( 0x1u << 12 ) /**< \brief (PWM_IMR2) Comparison 4 Match Interrupt Mask */
#define PWM_IMR2_CMPM5                      ( 0x1u << 13 ) /**< \brief (PWM_IMR2) Comparison 5 Match Interrupt Mask */
#define PWM_IMR2_CMPM6                      ( 0x1u << 14 ) /**< \brief (PWM_IMR2) Comparison 6 Match Interrupt Mask */
#define PWM_IMR2_CMPM7                      ( 0x1u << 15 ) /**< \brief (PWM_IMR2) Comparison 7 Match Interrupt Mask */
#define PWM_IMR2_CMPU0                      ( 0x1u << 16 ) /**< \brief (PWM_IMR2) Comparison 0 Update Interrupt Mask */
#define PWM_IMR2_CMPU1                      ( 0x1u << 17 ) /**< \brief (PWM_IMR2) Comparison 1 Update Interrupt Mask */
#define PWM_IMR2_CMPU2                      ( 0x1u << 18 ) /**< \brief (PWM_IMR2) Comparison 2 Update Interrupt Mask */
#define PWM_IMR2_CMPU3                      ( 0x1u << 19 ) /**< \brief (PWM_IMR2) Comparison 3 Update Interrupt Mask */
#define PWM_IMR2_CMPU4                      ( 0x1u << 20 ) /**< \brief (PWM_IMR2) Comparison 4 Update Interrupt Mask */
#define PWM_IMR2_CMPU5                      ( 0x1u << 21 ) /**< \brief (PWM_IMR2) Comparison 5 Update Interrupt Mask */
#define PWM_IMR2_CMPU6                      ( 0x1u << 22 ) /**< \brief (PWM_IMR2) Comparison 6 Update Interrupt Mask */
#define PWM_IMR2_CMPU7                      ( 0x1u << 23 ) /**< \brief (PWM_IMR2) Comparison 7 Update Interrupt Mask */
/* -------- PWM_ISR2 : (PWM Offset: 0x40) PWM Interrupt Status Register 2 -------- */
#define PWM_ISR2_WRDY                       ( 0x1u << 0 )  /**< \brief (PWM_ISR2) Write Ready for Synchronous Channels Update */
#define PWM_ISR2_UNRE                       ( 0x1u << 3 )  /**< \brief (PWM_ISR2) Synchronous Channels Update Underrun Error */
#define PWM_ISR2_CMPM0                      ( 0x1u << 8 )  /**< \brief (PWM_ISR2) Comparison 0 Match */
#define PWM_ISR2_CMPM1                      ( 0x1u << 9 )  /**< \brief (PWM_ISR2) Comparison 1 Match */
#define PWM_ISR2_CMPM2                      ( 0x1u << 10 ) /**< \brief (PWM_ISR2) Comparison 2 Match */
#define PWM_ISR2_CMPM3                      ( 0x1u << 11 ) /**< \brief (PWM_ISR2) Comparison 3 Match */
#define PWM_ISR2_CMPM4                      ( 0x1u << 12 ) /**< \brief (PWM_ISR2) Comparison 4 Match */
#define PWM_ISR2_CMPM5                      ( 0x1u << 13 ) /**< \brief (PWM_ISR2) Comparison 5 Match */
#define PWM_ISR2_CMPM6                      ( 0x1u << 14 ) /**< \brief (PWM_ISR2) Comparison 6 Match */
#define PWM_ISR2_CMPM7                      ( 0x1u << 15 ) /**< \brief (PWM_ISR2) Comparison 7 Match */
#define PWM_ISR2_CMPU0                      ( 0x1u << 16 ) /**< \brief (PWM_ISR2) Comparison 0 Update */
#define PWM_ISR2_CMPU1                      ( 0x1u << 17 ) /**< \brief (PWM_ISR2) Comparison 1 Update */
#define PWM_ISR2_CMPU2                      ( 0x1u << 18 ) /**< \brief (PWM_ISR2) Comparison 2 Update */
#define PWM_ISR2_CMPU3                      ( 0x1u << 19 ) /**< \brief (PWM_ISR2) Comparison 3 Update */
#define PWM_ISR2_CMPU4                      ( 0x1u << 20 ) /**< \brief (PWM_ISR2) Comparison 4 Update */
#define PWM_ISR2_CMPU5                      ( 0x1u << 21 ) /**< \brief (PWM_ISR2) Comparison 5 Update */
#define PWM_ISR2_CMPU6                      ( 0x1u << 22 ) /**< \brief (PWM_ISR2) Comparison 6 Update */
#define PWM_ISR2_CMPU7                      ( 0x1u << 23 ) /**< \brief (PWM_ISR2) Comparison 7 Update */
/* -------- PWM_OOV : (PWM Offset: 0x44) PWM Output Override Value Register -------- */
#define PWM_OOV_OOVH0                       ( 0x1u << 0 )  /**< \brief (PWM_OOV) Output Override Value for PWMH output of the channel 0 */
#define PWM_OOV_OOVH1                       ( 0x1u << 1 )  /**< \brief (PWM_OOV) Output Override Value for PWMH output of the channel 1 */
#define PWM_OOV_OOVH2                       ( 0x1u << 2 )  /**< \brief (PWM_OOV) Output Override Value for PWMH output of the channel 2 */
#define PWM_OOV_OOVH3                       ( 0x1u << 3 )  /**< \brief (PWM_OOV) Output Override Value for PWMH output of the channel 3 */
#define PWM_OOV_OOVL0                       ( 0x1u << 16 ) /**< \brief (PWM_OOV) Output Override Value for PWML output of the channel 0 */
#define PWM_OOV_OOVL1                       ( 0x1u << 17 ) /**< \brief (PWM_OOV) Output Override Value for PWML output of the channel 1 */
#define PWM_OOV_OOVL2                       ( 0x1u << 18 ) /**< \brief (PWM_OOV) Output Override Value for PWML output of the channel 2 */
#define PWM_OOV_OOVL3                       ( 0x1u << 19 ) /**< \brief (PWM_OOV) Output Override Value for PWML output of the channel 3 */
/* -------- PWM_OS : (PWM Offset: 0x48) PWM Output Selection Register -------- */
#define PWM_OS_OSH0                         ( 0x1u << 0 )  /**< \brief (PWM_OS) Output Selection for PWMH output of the channel 0 */
#define PWM_OS_OSH1                         ( 0x1u << 1 )  /**< \brief (PWM_OS) Output Selection for PWMH output of the channel 1 */
#define PWM_OS_OSH2                         ( 0x1u << 2 )  /**< \brief (PWM_OS) Output Selection for PWMH output of the channel 2 */
#define PWM_OS_OSH3                         ( 0x1u << 3 )  /**< \brief (PWM_OS) Output Selection for PWMH output of the channel 3 */
#define PWM_OS_OSL0                         ( 0x1u << 16 ) /**< \brief (PWM_OS) Output Selection for PWML output of the channel 0 */
#define PWM_OS_OSL1                         ( 0x1u << 17 ) /**< \brief (PWM_OS) Output Selection for PWML output of the channel 1 */
#define PWM_OS_OSL2                         ( 0x1u << 18 ) /**< \brief (PWM_OS) Output Selection for PWML output of the channel 2 */
#define PWM_OS_OSL3                         ( 0x1u << 19 ) /**< \brief (PWM_OS) Output Selection for PWML output of the channel 3 */
/* -------- PWM_OSS : (PWM Offset: 0x4C) PWM Output Selection Set Register -------- */
#define PWM_OSS_OSSH0                       ( 0x1u << 0 )  /**< \brief (PWM_OSS) Output Selection Set for PWMH output of the channel 0 */
#define PWM_OSS_OSSH1                       ( 0x1u << 1 )  /**< \brief (PWM_OSS) Output Selection Set for PWMH output of the channel 1 */
#define PWM_OSS_OSSH2                       ( 0x1u << 2 )  /**< \brief (PWM_OSS) Output Selection Set for PWMH output of the channel 2 */
#define PWM_OSS_OSSH3                       ( 0x1u << 3 )  /**< \brief (PWM_OSS) Output Selection Set for PWMH output of the channel 3 */
#define PWM_OSS_OSSL0                       ( 0x1u << 16 ) /**< \brief (PWM_OSS) Output Selection Set for PWML output of the channel 0 */
#define PWM_OSS_OSSL1                       ( 0x1u << 17 ) /**< \brief (PWM_OSS) Output Selection Set for PWML output of the channel 1 */
#define PWM_OSS_OSSL2                       ( 0x1u << 18 ) /**< \brief (PWM_OSS) Output Selection Set for PWML output of the channel 2 */
#define PWM_OSS_OSSL3                       ( 0x1u << 19 ) /**< \brief (PWM_OSS) Output Selection Set for PWML output of the channel 3 */
/* -------- PWM_OSC : (PWM Offset: 0x50) PWM Output Selection Clear Register -------- */
#define PWM_OSC_OSCH0                       ( 0x1u << 0 )  /**< \brief (PWM_OSC) Output Selection Clear for PWMH output of the channel 0 */
#define PWM_OSC_OSCH1                       ( 0x1u << 1 )  /**< \brief (PWM_OSC) Output Selection Clear for PWMH output of the channel 1 */
#define PWM_OSC_OSCH2                       ( 0x1u << 2 )  /**< \brief (PWM_OSC) Output Selection Clear for PWMH output of the channel 2 */
#define PWM_OSC_OSCH3                       ( 0x1u << 3 )  /**< \brief (PWM_OSC) Output Selection Clear for PWMH output of the channel 3 */
#define PWM_OSC_OSCL0                       ( 0x1u << 16 ) /**< \brief (PWM_OSC) Output Selection Clear for PWML output of the channel 0 */
#define PWM_OSC_OSCL1                       ( 0x1u << 17 ) /**< \brief (PWM_OSC) Output Selection Clear for PWML output of the channel 1 */
#define PWM_OSC_OSCL2                       ( 0x1u << 18 ) /**< \brief (PWM_OSC) Output Selection Clear for PWML output of the channel 2 */
#define PWM_OSC_OSCL3                       ( 0x1u << 19 ) /**< \brief (PWM_OSC) Output Selection Clear for PWML output of the channel 3 */
/* -------- PWM_OSSUPD : (PWM Offset: 0x54) PWM Output Selection Set Update Register -------- */
#define PWM_OSSUPD_OSSUPH0                  ( 0x1u << 0 )  /**< \brief (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 0 */
#define PWM_OSSUPD_OSSUPH1                  ( 0x1u << 1 )  /**< \brief (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 1 */
#define PWM_OSSUPD_OSSUPH2                  ( 0x1u << 2 )  /**< \brief (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 2 */
#define PWM_OSSUPD_OSSUPH3                  ( 0x1u << 3 )  /**< \brief (PWM_OSSUPD) Output Selection Set for PWMH output of the channel 3 */
#define PWM_OSSUPD_OSSUPL0                  ( 0x1u << 16 ) /**< \brief (PWM_OSSUPD) Output Selection Set for PWML output of the channel 0 */
#define PWM_OSSUPD_OSSUPL1                  ( 0x1u << 17 ) /**< \brief (PWM_OSSUPD) Output Selection Set for PWML output of the channel 1 */
#define PWM_OSSUPD_OSSUPL2                  ( 0x1u << 18 ) /**< \brief (PWM_OSSUPD) Output Selection Set for PWML output of the channel 2 */
#define PWM_OSSUPD_OSSUPL3                  ( 0x1u << 19 ) /**< \brief (PWM_OSSUPD) Output Selection Set for PWML output of the channel 3 */
/* -------- PWM_OSCUPD : (PWM Offset: 0x58) PWM Output Selection Clear Update Register -------- */
#define PWM_OSCUPD_OSCUPH0                  ( 0x1u << 0 )  /**< \brief (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 0 */
#define PWM_OSCUPD_OSCUPH1                  ( 0x1u << 1 )  /**< \brief (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 1 */
#define PWM_OSCUPD_OSCUPH2                  ( 0x1u << 2 )  /**< \brief (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 2 */
#define PWM_OSCUPD_OSCUPH3                  ( 0x1u << 3 )  /**< \brief (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 3 */
#define PWM_OSCUPD_OSCUPL0                  ( 0x1u << 16 ) /**< \brief (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 0 */
#define PWM_OSCUPD_OSCUPL1                  ( 0x1u << 17 ) /**< \brief (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 1 */
#define PWM_OSCUPD_OSCUPL2                  ( 0x1u << 18 ) /**< \brief (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 2 */
#define PWM_OSCUPD_OSCUPL3                  ( 0x1u << 19 ) /**< \brief (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 3 */
/* -------- PWM_FMR : (PWM Offset: 0x5C) PWM Fault Mode Register -------- */
#define PWM_FMR_FPOL_Pos                    0
#define PWM_FMR_FPOL_Msk                    ( 0xffu << PWM_FMR_FPOL_Pos ) /**< \brief (PWM_FMR) Fault Polarity */
#define PWM_FMR_FPOL( value )    ( ( PWM_FMR_FPOL_Msk & ( ( value ) << PWM_FMR_FPOL_Pos ) ) )
#define PWM_FMR_FMOD_Pos                    8
#define PWM_FMR_FMOD_Msk                    ( 0xffu << PWM_FMR_FMOD_Pos ) /**< \brief (PWM_FMR) Fault Activation Mode */
#define PWM_FMR_FMOD( value )    ( ( PWM_FMR_FMOD_Msk & ( ( value ) << PWM_FMR_FMOD_Pos ) ) )
#define PWM_FMR_FFIL_Pos                    16
#define PWM_FMR_FFIL_Msk                    ( 0xffu << PWM_FMR_FFIL_Pos ) /**< \brief (PWM_FMR) Fault Filtering */
#define PWM_FMR_FFIL( value )    ( ( PWM_FMR_FFIL_Msk & ( ( value ) << PWM_FMR_FFIL_Pos ) ) )
/* -------- PWM_FSR : (PWM Offset: 0x60) PWM Fault Status Register -------- */
#define PWM_FSR_FIV_Pos                     0
#define PWM_FSR_FIV_Msk                     ( 0xffu << PWM_FSR_FIV_Pos ) /**< \brief (PWM_FSR) Fault Input Value */
#define PWM_FSR_FS_Pos                      8
#define PWM_FSR_FS_Msk                      ( 0xffu << PWM_FSR_FS_Pos )  /**< \brief (PWM_FSR) Fault Status */
/* -------- PWM_FCR : (PWM Offset: 0x64) PWM Fault Clear Register -------- */
#define PWM_FCR_FCLR_Pos                    0
#define PWM_FCR_FCLR_Msk                    ( 0xffu << PWM_FCR_FCLR_Pos ) /**< \brief (PWM_FCR) Fault Clear */
#define PWM_FCR_FCLR( value )    ( ( PWM_FCR_FCLR_Msk & ( ( value ) << PWM_FCR_FCLR_Pos ) ) )
/* -------- PWM_FPV1 : (PWM Offset: 0x68) PWM Fault Protection Value Register 1 -------- */
#define PWM_FPV1_FPVH0                      ( 0x1u << 0 )  /**< \brief (PWM_FPV1) Fault Protection Value for PWMH output on channel 0 */
#define PWM_FPV1_FPVH1                      ( 0x1u << 1 )  /**< \brief (PWM_FPV1) Fault Protection Value for PWMH output on channel 1 */
#define PWM_FPV1_FPVH2                      ( 0x1u << 2 )  /**< \brief (PWM_FPV1) Fault Protection Value for PWMH output on channel 2 */
#define PWM_FPV1_FPVH3                      ( 0x1u << 3 )  /**< \brief (PWM_FPV1) Fault Protection Value for PWMH output on channel 3 */
#define PWM_FPV1_FPVL0                      ( 0x1u << 16 ) /**< \brief (PWM_FPV1) Fault Protection Value for PWML output on channel 0 */
#define PWM_FPV1_FPVL1                      ( 0x1u << 17 ) /**< \brief (PWM_FPV1) Fault Protection Value for PWML output on channel 1 */
#define PWM_FPV1_FPVL2                      ( 0x1u << 18 ) /**< \brief (PWM_FPV1) Fault Protection Value for PWML output on channel 2 */
#define PWM_FPV1_FPVL3                      ( 0x1u << 19 ) /**< \brief (PWM_FPV1) Fault Protection Value for PWML output on channel 3 */
/* -------- PWM_FPE : (PWM Offset: 0x6C) PWM Fault Protection Enable Register -------- */
#define PWM_FPE_FPE0_Pos                    0
#define PWM_FPE_FPE0_Msk                    ( 0xffu << PWM_FPE_FPE0_Pos ) /**< \brief (PWM_FPE) Fault Protection Enable for channel 0 */
#define PWM_FPE_FPE0( value )    ( ( PWM_FPE_FPE0_Msk & ( ( value ) << PWM_FPE_FPE0_Pos ) ) )
#define PWM_FPE_FPE1_Pos                    8
#define PWM_FPE_FPE1_Msk                    ( 0xffu << PWM_FPE_FPE1_Pos ) /**< \brief (PWM_FPE) Fault Protection Enable for channel 1 */
#define PWM_FPE_FPE1( value )    ( ( PWM_FPE_FPE1_Msk & ( ( value ) << PWM_FPE_FPE1_Pos ) ) )
#define PWM_FPE_FPE2_Pos                    16
#define PWM_FPE_FPE2_Msk                    ( 0xffu << PWM_FPE_FPE2_Pos ) /**< \brief (PWM_FPE) Fault Protection Enable for channel 2 */
#define PWM_FPE_FPE2( value )    ( ( PWM_FPE_FPE2_Msk & ( ( value ) << PWM_FPE_FPE2_Pos ) ) )
#define PWM_FPE_FPE3_Pos                    24
#define PWM_FPE_FPE3_Msk                    ( 0xffu << PWM_FPE_FPE3_Pos ) /**< \brief (PWM_FPE) Fault Protection Enable for channel 3 */
#define PWM_FPE_FPE3( value )    ( ( PWM_FPE_FPE3_Msk & ( ( value ) << PWM_FPE_FPE3_Pos ) ) )
/* -------- PWM_ELMR[8] : (PWM Offset: 0x7C) PWM Event Line 0 Mode Register -------- */
#define PWM_ELMR_CSEL0                      ( 0x1u << 0 ) /**< \brief (PWM_ELMR[8]) Comparison 0 Selection */
#define PWM_ELMR_CSEL1                      ( 0x1u << 1 ) /**< \brief (PWM_ELMR[8]) Comparison 1 Selection */
#define PWM_ELMR_CSEL2                      ( 0x1u << 2 ) /**< \brief (PWM_ELMR[8]) Comparison 2 Selection */
#define PWM_ELMR_CSEL3                      ( 0x1u << 3 ) /**< \brief (PWM_ELMR[8]) Comparison 3 Selection */
#define PWM_ELMR_CSEL4                      ( 0x1u << 4 ) /**< \brief (PWM_ELMR[8]) Comparison 4 Selection */
#define PWM_ELMR_CSEL5                      ( 0x1u << 5 ) /**< \brief (PWM_ELMR[8]) Comparison 5 Selection */
#define PWM_ELMR_CSEL6                      ( 0x1u << 6 ) /**< \brief (PWM_ELMR[8]) Comparison 6 Selection */
#define PWM_ELMR_CSEL7                      ( 0x1u << 7 ) /**< \brief (PWM_ELMR[8]) Comparison 7 Selection */
/* -------- PWM_SSPR : (PWM Offset: 0xA0) PWM Spread Spectrum Register -------- */
#define PWM_SSPR_SPRD_Pos                   0
#define PWM_SSPR_SPRD_Msk                   ( 0xffffffu << PWM_SSPR_SPRD_Pos ) /**< \brief (PWM_SSPR) Spread Spectrum Limit Value */
#define PWM_SSPR_SPRD( value )    ( ( PWM_SSPR_SPRD_Msk & ( ( value ) << PWM_SSPR_SPRD_Pos ) ) )
#define PWM_SSPR_SPRDM                      ( 0x1u << 24 )                     /**< \brief (PWM_SSPR) Spread Spectrum Counter Mode */
/* -------- PWM_SSPUP : (PWM Offset: 0xA4) PWM Spread Spectrum Update Register -------- */
#define PWM_SSPUP_SPRDUP_Pos                0
#define PWM_SSPUP_SPRDUP_Msk                ( 0xffffffu << PWM_SSPUP_SPRDUP_Pos ) /**< \brief (PWM_SSPUP) Spread Spectrum Limit Value Update */
#define PWM_SSPUP_SPRDUP( value )    ( ( PWM_SSPUP_SPRDUP_Msk & ( ( value ) << PWM_SSPUP_SPRDUP_Pos ) ) )
/* -------- PWM_SMMR : (PWM Offset: 0xB0) PWM Stepper Motor Mode Register -------- */
#define PWM_SMMR_GCEN0                      ( 0x1u << 0 )  /**< \brief (PWM_SMMR) Gray Count ENable */
#define PWM_SMMR_GCEN1                      ( 0x1u << 1 )  /**< \brief (PWM_SMMR) Gray Count ENable */
#define PWM_SMMR_DOWN0                      ( 0x1u << 16 ) /**< \brief (PWM_SMMR) DOWN Count */
#define PWM_SMMR_DOWN1                      ( 0x1u << 17 ) /**< \brief (PWM_SMMR) DOWN Count */
/* -------- PWM_FPV2 : (PWM Offset: 0xC0) PWM Fault Protection Value 2 Register -------- */
#define PWM_FPV2_FPZH0                      ( 0x1u << 0 )  /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 */
#define PWM_FPV2_FPZH1                      ( 0x1u << 1 )  /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 */
#define PWM_FPV2_FPZH2                      ( 0x1u << 2 )  /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 */
