FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_pwm.h
#define PWM_FPV2_FPZH3                      ( 0x1u << 3 )  /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 */
#define PWM_FPV2_FPZL0                      ( 0x1u << 16 ) /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 */
#define PWM_FPV2_FPZL1                      ( 0x1u << 17 ) /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 */
#define PWM_FPV2_FPZL2                      ( 0x1u << 18 ) /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 */
#define PWM_FPV2_FPZL3                      ( 0x1u << 19 ) /**< \brief (PWM_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 */
/* -------- PWM_WPCR : (PWM Offset: 0xE4) PWM Write Protection Control Register -------- */
#define PWM_WPCR_WPCMD_Pos                  0
#define PWM_WPCR_WPCMD_Msk                  ( 0x3u << PWM_WPCR_WPCMD_Pos )      /**< \brief (PWM_WPCR) Write Protection Command */
#define PWM_WPCR_WPCMD( value )    ( ( PWM_WPCR_WPCMD_Msk & ( ( value ) << PWM_WPCR_WPCMD_Pos ) ) )
#define   PWM_WPCR_WPCMD_DISABLE_SW_PROT    ( 0x0u << 0 )                       /**< \brief (PWM_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'. */
#define   PWM_WPCR_WPCMD_ENABLE_SW_PROT     ( 0x1u << 0 )                       /**< \brief (PWM_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'. */
#define   PWM_WPCR_WPCMD_ENABLE_HW_PROT     ( 0x2u << 0 )                       /**< \brief (PWM_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface. */
#define PWM_WPCR_WPRG0                      ( 0x1u << 2 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 0 */
#define PWM_WPCR_WPRG1                      ( 0x1u << 3 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 1 */
#define PWM_WPCR_WPRG2                      ( 0x1u << 4 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 2 */
#define PWM_WPCR_WPRG3                      ( 0x1u << 5 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 3 */
#define PWM_WPCR_WPRG4                      ( 0x1u << 6 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 4 */
#define PWM_WPCR_WPRG5                      ( 0x1u << 7 )                       /**< \brief (PWM_WPCR) Write Protection Register Group 5 */
#define PWM_WPCR_WPKEY_Pos                  8
#define PWM_WPCR_WPKEY_Msk                  ( 0xffffffu << PWM_WPCR_WPKEY_Pos ) /**< \brief (PWM_WPCR) Write Protection Key */
#define PWM_WPCR_WPKEY( value )    ( ( PWM_WPCR_WPKEY_Msk & ( ( value ) << PWM_WPCR_WPKEY_Pos ) ) )
#define   PWM_WPCR_WPKEY_PASSWD             ( 0x50574Du << 8 )                  /**< \brief (PWM_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0 */
/* -------- PWM_WPSR : (PWM Offset: 0xE8) PWM Write Protection Status Register -------- */
#define PWM_WPSR_WPSWS0                     ( 0x1u << 0 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPSWS1                     ( 0x1u << 1 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPSWS2                     ( 0x1u << 2 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPSWS3                     ( 0x1u << 3 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPSWS4                     ( 0x1u << 4 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPSWS5                     ( 0x1u << 5 )                       /**< \brief (PWM_WPSR) Write Protect SW Status */
#define PWM_WPSR_WPVS                       ( 0x1u << 7 )                       /**< \brief (PWM_WPSR) Write Protect Violation Status */
#define PWM_WPSR_WPHWS0                     ( 0x1u << 8 )                       /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPHWS1                     ( 0x1u << 9 )                       /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPHWS2                     ( 0x1u << 10 )                      /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPHWS3                     ( 0x1u << 11 )                      /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPHWS4                     ( 0x1u << 12 )                      /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPHWS5                     ( 0x1u << 13 )                      /**< \brief (PWM_WPSR) Write Protect HW Status */
#define PWM_WPSR_WPVSRC_Pos                 16
#define PWM_WPSR_WPVSRC_Msk                 ( 0xffffu << PWM_WPSR_WPVSRC_Pos )  /**< \brief (PWM_WPSR) Write Protect Violation Source */
/* -------- PWM_CMPV : (PWM Offset: N/A) PWM Comparison 0 Value Register -------- */
#define PWM_CMPV_CV_Pos                     0
#define PWM_CMPV_CV_Msk                     ( 0xffffffu << PWM_CMPV_CV_Pos ) /**< \brief (PWM_CMPV) Comparison x Value */
#define PWM_CMPV_CV( value )    ( ( PWM_CMPV_CV_Msk & ( ( value ) << PWM_CMPV_CV_Pos ) ) )
#define PWM_CMPV_CVM                        ( 0x1u << 24 )                   /**< \brief (PWM_CMPV) Comparison x Value Mode */
/* -------- PWM_CMPVUPD : (PWM Offset: N/A) PWM Comparison 0 Value Update Register -------- */
#define PWM_CMPVUPD_CVUPD_Pos               0
#define PWM_CMPVUPD_CVUPD_Msk               ( 0xffffffu << PWM_CMPVUPD_CVUPD_Pos ) /**< \brief (PWM_CMPVUPD) Comparison x Value Update */
#define PWM_CMPVUPD_CVUPD( value )    ( ( PWM_CMPVUPD_CVUPD_Msk & ( ( value ) << PWM_CMPVUPD_CVUPD_Pos ) ) )
#define PWM_CMPVUPD_CVMUPD                  ( 0x1u << 24 )                         /**< \brief (PWM_CMPVUPD) Comparison x Value Mode Update */
/* -------- PWM_CMPM : (PWM Offset: N/A) PWM Comparison 0 Mode Register -------- */
#define PWM_CMPM_CEN                        ( 0x1u << 0 )                          /**< \brief (PWM_CMPM) Comparison x Enable */
#define PWM_CMPM_CTR_Pos                    4
#define PWM_CMPM_CTR_Msk                    ( 0xfu << PWM_CMPM_CTR_Pos )           /**< \brief (PWM_CMPM) Comparison x Trigger */
#define PWM_CMPM_CTR( value )        ( ( PWM_CMPM_CTR_Msk & ( ( value ) << PWM_CMPM_CTR_Pos ) ) )
#define PWM_CMPM_CPR_Pos                    8
#define PWM_CMPM_CPR_Msk                    ( 0xfu << PWM_CMPM_CPR_Pos ) /**< \brief (PWM_CMPM) Comparison x Period */
#define PWM_CMPM_CPR( value )        ( ( PWM_CMPM_CPR_Msk & ( ( value ) << PWM_CMPM_CPR_Pos ) ) )
#define PWM_CMPM_CPRCNT_Pos                 12
#define PWM_CMPM_CPRCNT_Msk                 ( 0xfu << PWM_CMPM_CPRCNT_Pos ) /**< \brief (PWM_CMPM) Comparison x Period Counter */
#define PWM_CMPM_CPRCNT( value )     ( ( PWM_CMPM_CPRCNT_Msk & ( ( value ) << PWM_CMPM_CPRCNT_Pos ) ) )
#define PWM_CMPM_CUPR_Pos                   16
#define PWM_CMPM_CUPR_Msk                   ( 0xfu << PWM_CMPM_CUPR_Pos ) /**< \brief (PWM_CMPM) Comparison x Update Period */
#define PWM_CMPM_CUPR( value )       ( ( PWM_CMPM_CUPR_Msk & ( ( value ) << PWM_CMPM_CUPR_Pos ) ) )
#define PWM_CMPM_CUPRCNT_Pos                20
#define PWM_CMPM_CUPRCNT_Msk                ( 0xfu << PWM_CMPM_CUPRCNT_Pos ) /**< \brief (PWM_CMPM) Comparison x Update Period Counter */
#define PWM_CMPM_CUPRCNT( value )    ( ( PWM_CMPM_CUPRCNT_Msk & ( ( value ) << PWM_CMPM_CUPRCNT_Pos ) ) )
/* -------- PWM_CMPMUPD : (PWM Offset: N/A) PWM Comparison 0 Mode Update Register -------- */
#define PWM_CMPMUPD_CENUPD                  ( 0x1u << 0 )                      /**< \brief (PWM_CMPMUPD) Comparison x Enable Update */
#define PWM_CMPMUPD_CTRUPD_Pos              4
#define PWM_CMPMUPD_CTRUPD_Msk              ( 0xfu << PWM_CMPMUPD_CTRUPD_Pos ) /**< \brief (PWM_CMPMUPD) Comparison x Trigger Update */
#define PWM_CMPMUPD_CTRUPD( value )     ( ( PWM_CMPMUPD_CTRUPD_Msk & ( ( value ) << PWM_CMPMUPD_CTRUPD_Pos ) ) )
#define PWM_CMPMUPD_CPRUPD_Pos              8
#define PWM_CMPMUPD_CPRUPD_Msk              ( 0xfu << PWM_CMPMUPD_CPRUPD_Pos ) /**< \brief (PWM_CMPMUPD) Comparison x Period Update */
#define PWM_CMPMUPD_CPRUPD( value )     ( ( PWM_CMPMUPD_CPRUPD_Msk & ( ( value ) << PWM_CMPMUPD_CPRUPD_Pos ) ) )
#define PWM_CMPMUPD_CUPRUPD_Pos             16
#define PWM_CMPMUPD_CUPRUPD_Msk             ( 0xfu << PWM_CMPMUPD_CUPRUPD_Pos ) /**< \brief (PWM_CMPMUPD) Comparison x Update Period Update */
#define PWM_CMPMUPD_CUPRUPD( value )    ( ( PWM_CMPMUPD_CUPRUPD_Msk & ( ( value ) << PWM_CMPMUPD_CUPRUPD_Pos ) ) )
/* -------- PWM_CMR : (PWM Offset: N/A) PWM Channel Mode Register -------- */
#define PWM_CMR_CPRE_Pos                    0
#define PWM_CMR_CPRE_Msk                    ( 0xfu << PWM_CMR_CPRE_Pos ) /**< \brief (PWM_CMR) Channel Pre-scaler */
#define PWM_CMR_CPRE( value )    ( ( PWM_CMR_CPRE_Msk & ( ( value ) << PWM_CMR_CPRE_Pos ) ) )
#define   PWM_CMR_CPRE_MCK                  ( 0x0u << 0 )                /**< \brief (PWM_CMR) Peripheral clock */
#define   PWM_CMR_CPRE_MCK_DIV_2            ( 0x1u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/2 */
#define   PWM_CMR_CPRE_MCK_DIV_4            ( 0x2u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/4 */
#define   PWM_CMR_CPRE_MCK_DIV_8            ( 0x3u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/8 */
#define   PWM_CMR_CPRE_MCK_DIV_16           ( 0x4u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/16 */
#define   PWM_CMR_CPRE_MCK_DIV_32           ( 0x5u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/32 */
#define   PWM_CMR_CPRE_MCK_DIV_64           ( 0x6u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/64 */
#define   PWM_CMR_CPRE_MCK_DIV_128          ( 0x7u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/128 */
#define   PWM_CMR_CPRE_MCK_DIV_256          ( 0x8u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/256 */
#define   PWM_CMR_CPRE_MCK_DIV_512          ( 0x9u << 0 )                /**< \brief (PWM_CMR) Peripheral clock/512 */
#define   PWM_CMR_CPRE_MCK_DIV_1024         ( 0xAu << 0 )                /**< \brief (PWM_CMR) Peripheral clock/1024 */
#define   PWM_CMR_CPRE_CLKA                 ( 0xBu << 0 )                /**< \brief (PWM_CMR) Clock A */
#define   PWM_CMR_CPRE_CLKB                 ( 0xCu << 0 )                /**< \brief (PWM_CMR) Clock B */
#define PWM_CMR_CALG                        ( 0x1u << 8 )                /**< \brief (PWM_CMR) Channel Alignment */
#define PWM_CMR_CPOL                        ( 0x1u << 9 )                /**< \brief (PWM_CMR) Channel Polarity */
#define PWM_CMR_CES                         ( 0x1u << 10 )               /**< \brief (PWM_CMR) Counter Event Selection */
#define PWM_CMR_UPDS                        ( 0x1u << 11 )               /**< \brief (PWM_CMR) Update Selection */
#define PWM_CMR_DPOLI                       ( 0x1u << 12 )               /**< \brief (PWM_CMR) Disabled Polarity Inverted */
#define PWM_CMR_TCTS                        ( 0x1u << 13 )               /**< \brief (PWM_CMR) Timer Counter Trigger Selection */
#define PWM_CMR_DTE                         ( 0x1u << 16 )               /**< \brief (PWM_CMR) Dead-Time Generator Enable */
#define PWM_CMR_DTHI                        ( 0x1u << 17 )               /**< \brief (PWM_CMR) Dead-Time PWMHx Output Inverted */
#define PWM_CMR_DTLI                        ( 0x1u << 18 )               /**< \brief (PWM_CMR) Dead-Time PWMLx Output Inverted */
#define PWM_CMR_PPM                         ( 0x1u << 19 )               /**< \brief (PWM_CMR) Push-Pull Mode */
/* -------- PWM_CDTY : (PWM Offset: N/A) PWM Channel Duty Cycle Register -------- */
#define PWM_CDTY_CDTY_Pos                   0
#define PWM_CDTY_CDTY_Msk                   ( 0xffffffu << PWM_CDTY_CDTY_Pos ) /**< \brief (PWM_CDTY) Channel Duty-Cycle */
#define PWM_CDTY_CDTY( value )    ( ( PWM_CDTY_CDTY_Msk & ( ( value ) << PWM_CDTY_CDTY_Pos ) ) )
/* -------- PWM_CDTYUPD : (PWM Offset: N/A) PWM Channel Duty Cycle Update Register -------- */
#define PWM_CDTYUPD_CDTYUPD_Pos             0
#define PWM_CDTYUPD_CDTYUPD_Msk             ( 0xffffffu << PWM_CDTYUPD_CDTYUPD_Pos ) /**< \brief (PWM_CDTYUPD) Channel Duty-Cycle Update */
#define PWM_CDTYUPD_CDTYUPD( value )    ( ( PWM_CDTYUPD_CDTYUPD_Msk & ( ( value ) << PWM_CDTYUPD_CDTYUPD_Pos ) ) )
/* -------- PWM_CPRD : (PWM Offset: N/A) PWM Channel Period Register -------- */
#define PWM_CPRD_CPRD_Pos                   0
#define PWM_CPRD_CPRD_Msk                   ( 0xffffffu << PWM_CPRD_CPRD_Pos ) /**< \brief (PWM_CPRD) Channel Period */
#define PWM_CPRD_CPRD( value )    ( ( PWM_CPRD_CPRD_Msk & ( ( value ) << PWM_CPRD_CPRD_Pos ) ) )
/* -------- PWM_CPRDUPD : (PWM Offset: N/A) PWM Channel Period Update Register -------- */
#define PWM_CPRDUPD_CPRDUPD_Pos             0
#define PWM_CPRDUPD_CPRDUPD_Msk             ( 0xffffffu << PWM_CPRDUPD_CPRDUPD_Pos ) /**< \brief (PWM_CPRDUPD) Channel Period Update */
#define PWM_CPRDUPD_CPRDUPD( value )    ( ( PWM_CPRDUPD_CPRDUPD_Msk & ( ( value ) << PWM_CPRDUPD_CPRDUPD_Pos ) ) )
/* -------- PWM_CCNT : (PWM Offset: N/A) PWM Channel Counter Register -------- */
#define PWM_CCNT_CNT_Pos                    0
#define PWM_CCNT_CNT_Msk                    ( 0xffffffu << PWM_CCNT_CNT_Pos ) /**< \brief (PWM_CCNT) Channel Counter Register */
/* -------- PWM_DT : (PWM Offset: N/A) PWM Channel Dead Time Register -------- */
#define PWM_DT_DTH_Pos                      0
#define PWM_DT_DTH_Msk                      ( 0xffffu << PWM_DT_DTH_Pos ) /**< \brief (PWM_DT) Dead-Time Value for PWMHx Output */
#define PWM_DT_DTH( value )    ( ( PWM_DT_DTH_Msk & ( ( value ) << PWM_DT_DTH_Pos ) ) )
#define PWM_DT_DTL_Pos                      16
#define PWM_DT_DTL_Msk                      ( 0xffffu << PWM_DT_DTL_Pos ) /**< \brief (PWM_DT) Dead-Time Value for PWMLx Output */
#define PWM_DT_DTL( value )    ( ( PWM_DT_DTL_Msk & ( ( value ) << PWM_DT_DTL_Pos ) ) )
/* -------- PWM_DTUPD : (PWM Offset: N/A) PWM Channel Dead Time Update Register -------- */
#define PWM_DTUPD_DTHUPD_Pos                0
#define PWM_DTUPD_DTHUPD_Msk                ( 0xffffu << PWM_DTUPD_DTHUPD_Pos ) /**< \brief (PWM_DTUPD) Dead-Time Value Update for PWMHx Output */
#define PWM_DTUPD_DTHUPD( value )    ( ( PWM_DTUPD_DTHUPD_Msk & ( ( value ) << PWM_DTUPD_DTHUPD_Pos ) ) )
#define PWM_DTUPD_DTLUPD_Pos                16
#define PWM_DTUPD_DTLUPD_Msk                ( 0xffffu << PWM_DTUPD_DTLUPD_Pos ) /**< \brief (PWM_DTUPD) Dead-Time Value Update for PWMLx Output */
#define PWM_DTUPD_DTLUPD( value )    ( ( PWM_DTUPD_DTLUPD_Msk & ( ( value ) << PWM_DTUPD_DTLUPD_Pos ) ) )
/* -------- PWM_CMUPD0 : (PWM Offset: 0x400) PWM Channel Mode Update Register (ch_num = 0) -------- */
#define PWM_CMUPD0_CPOLUP                   ( 0x1u << 9 )  /**< \brief (PWM_CMUPD0) Channel Polarity Update */
#define PWM_CMUPD0_CPOLINVUP                ( 0x1u << 13 ) /**< \brief (PWM_CMUPD0) Channel Polarity Inversion Update */
/* -------- PWM_CMUPD1 : (PWM Offset: 0x420) PWM Channel Mode Update Register (ch_num = 1) -------- */
#define PWM_CMUPD1_CPOLUP                   ( 0x1u << 9 )  /**< \brief (PWM_CMUPD1) Channel Polarity Update */
#define PWM_CMUPD1_CPOLINVUP                ( 0x1u << 13 ) /**< \brief (PWM_CMUPD1) Channel Polarity Inversion Update */
/* -------- PWM_ETRG1 : (PWM Offset: 0x42C) PWM External Trigger Register (trg_num = 1) -------- */
#define PWM_ETRG1_MAXCNT_Pos                0
#define PWM_ETRG1_MAXCNT_Msk                ( 0xffffffu << PWM_ETRG1_MAXCNT_Pos ) /**< \brief (PWM_ETRG1) Maximum Counter value */
#define PWM_ETRG1_MAXCNT( value )     ( ( PWM_ETRG1_MAXCNT_Msk & ( ( value ) << PWM_ETRG1_MAXCNT_Pos ) ) )
#define PWM_ETRG1_TRGMODE_Pos               24
#define PWM_ETRG1_TRGMODE_Msk               ( 0x3u << PWM_ETRG1_TRGMODE_Pos ) /**< \brief (PWM_ETRG1) External Trigger Mode */
#define PWM_ETRG1_TRGMODE( value )    ( ( PWM_ETRG1_TRGMODE_Msk & ( ( value ) << PWM_ETRG1_TRGMODE_Pos ) ) )
#define   PWM_ETRG1_TRGMODE_OFF             ( 0x0u << 24 )                    /**< \brief (PWM_ETRG1) External trigger is not enabled. */
#define   PWM_ETRG1_TRGMODE_MODE1           ( 0x1u << 24 )                    /**< \brief (PWM_ETRG1) External PWM Reset Mode */
#define   PWM_ETRG1_TRGMODE_MODE2           ( 0x2u << 24 )                    /**< \brief (PWM_ETRG1) External PWM Start Mode */
#define   PWM_ETRG1_TRGMODE_MODE3           ( 0x3u << 24 )                    /**< \brief (PWM_ETRG1) Cycle-by-cycle Duty Mode */
#define PWM_ETRG1_TRGEDGE                   ( 0x1u << 28 )                    /**< \brief (PWM_ETRG1) Edge Selection */
#define   PWM_ETRG1_TRGEDGE_FALLING_ZERO    ( 0x0u << 28 )                    /**< \brief (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 */
#define   PWM_ETRG1_TRGEDGE_RISING_ONE      ( 0x1u << 28 )                    /**< \brief (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 */
#define PWM_ETRG1_TRGFILT                   ( 0x1u << 29 )                    /**< \brief (PWM_ETRG1) Filtered input */
#define PWM_ETRG1_TRGSRC                    ( 0x1u << 30 )                    /**< \brief (PWM_ETRG1) Trigger Source */
#define PWM_ETRG1_RFEN                      ( 0x1u << 31 )                    /**< \brief (PWM_ETRG1) Recoverable Fault Enable */
/* -------- PWM_LEBR1 : (PWM Offset: 0x430) PWM Leading-Edge Blanking Register (trg_num = 1) -------- */
#define PWM_LEBR1_LEBDELAY_Pos              0
#define PWM_LEBR1_LEBDELAY_Msk              ( 0x7fu << PWM_LEBR1_LEBDELAY_Pos ) /**< \brief (PWM_LEBR1) Leading-Edge Blanking Delay for TRGINx */
#define PWM_LEBR1_LEBDELAY( value )    ( ( PWM_LEBR1_LEBDELAY_Msk & ( ( value ) << PWM_LEBR1_LEBDELAY_Pos ) ) )
#define PWM_LEBR1_PWMLFEN                   ( 0x1u << 16 )                      /**< \brief (PWM_LEBR1) PWML Falling Edge Enable */
#define PWM_LEBR1_PWMLREN                   ( 0x1u << 17 )                      /**< \brief (PWM_LEBR1) PWML Rising Edge Enable */
#define PWM_LEBR1_PWMHFEN                   ( 0x1u << 18 )                      /**< \brief (PWM_LEBR1) PWMH Falling Edge Enable */
#define PWM_LEBR1_PWMHREN                   ( 0x1u << 19 )                      /**< \brief (PWM_LEBR1) PWMH Rising Edge Enable */
/* -------- PWM_CMUPD2 : (PWM Offset: 0x440) PWM Channel Mode Update Register (ch_num = 2) -------- */
#define PWM_CMUPD2_CPOLUP                   ( 0x1u << 9 )                       /**< \brief (PWM_CMUPD2) Channel Polarity Update */
#define PWM_CMUPD2_CPOLINVUP                ( 0x1u << 13 )                      /**< \brief (PWM_CMUPD2) Channel Polarity Inversion Update */
/* -------- PWM_ETRG2 : (PWM Offset: 0x44C) PWM External Trigger Register (trg_num = 2) -------- */
#define PWM_ETRG2_MAXCNT_Pos                0
#define PWM_ETRG2_MAXCNT_Msk                ( 0xffffffu << PWM_ETRG2_MAXCNT_Pos ) /**< \brief (PWM_ETRG2) Maximum Counter value */
#define PWM_ETRG2_MAXCNT( value )     ( ( PWM_ETRG2_MAXCNT_Msk & ( ( value ) << PWM_ETRG2_MAXCNT_Pos ) ) )
#define PWM_ETRG2_TRGMODE_Pos               24
#define PWM_ETRG2_TRGMODE_Msk               ( 0x3u << PWM_ETRG2_TRGMODE_Pos ) /**< \brief (PWM_ETRG2) External Trigger Mode */
#define PWM_ETRG2_TRGMODE( value )    ( ( PWM_ETRG2_TRGMODE_Msk & ( ( value ) << PWM_ETRG2_TRGMODE_Pos ) ) )
#define   PWM_ETRG2_TRGMODE_OFF             ( 0x0u << 24 )                    /**< \brief (PWM_ETRG2) External trigger is not enabled. */
#define   PWM_ETRG2_TRGMODE_MODE1           ( 0x1u << 24 )                    /**< \brief (PWM_ETRG2) External PWM Reset Mode */
#define   PWM_ETRG2_TRGMODE_MODE2           ( 0x2u << 24 )                    /**< \brief (PWM_ETRG2) External PWM Start Mode */
#define   PWM_ETRG2_TRGMODE_MODE3           ( 0x3u << 24 )                    /**< \brief (PWM_ETRG2) Cycle-by-cycle Duty Mode */
#define PWM_ETRG2_TRGEDGE                   ( 0x1u << 28 )                    /**< \brief (PWM_ETRG2) Edge Selection */
#define   PWM_ETRG2_TRGEDGE_FALLING_ZERO    ( 0x0u << 28 )                    /**< \brief (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 */
#define   PWM_ETRG2_TRGEDGE_RISING_ONE      ( 0x1u << 28 )                    /**< \brief (PWM_ETRG2) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 */
#define PWM_ETRG2_TRGFILT                   ( 0x1u << 29 )                    /**< \brief (PWM_ETRG2) Filtered input */
#define PWM_ETRG2_TRGSRC                    ( 0x1u << 30 )                    /**< \brief (PWM_ETRG2) Trigger Source */
#define PWM_ETRG2_RFEN                      ( 0x1u << 31 )                    /**< \brief (PWM_ETRG2) Recoverable Fault Enable */
/* -------- PWM_LEBR2 : (PWM Offset: 0x450) PWM Leading-Edge Blanking Register (trg_num = 2) -------- */
#define PWM_LEBR2_LEBDELAY_Pos              0
#define PWM_LEBR2_LEBDELAY_Msk              ( 0x7fu << PWM_LEBR2_LEBDELAY_Pos ) /**< \brief (PWM_LEBR2) Leading-Edge Blanking Delay for TRGINx */
#define PWM_LEBR2_LEBDELAY( value )    ( ( PWM_LEBR2_LEBDELAY_Msk & ( ( value ) << PWM_LEBR2_LEBDELAY_Pos ) ) )
#define PWM_LEBR2_PWMLFEN                   ( 0x1u << 16 )                      /**< \brief (PWM_LEBR2) PWML Falling Edge Enable */
#define PWM_LEBR2_PWMLREN                   ( 0x1u << 17 )                      /**< \brief (PWM_LEBR2) PWML Rising Edge Enable */
#define PWM_LEBR2_PWMHFEN                   ( 0x1u << 18 )                      /**< \brief (PWM_LEBR2) PWMH Falling Edge Enable */
#define PWM_LEBR2_PWMHREN                   ( 0x1u << 19 )                      /**< \brief (PWM_LEBR2) PWMH Rising Edge Enable */
/* -------- PWM_CMUPD3 : (PWM Offset: 0x460) PWM Channel Mode Update Register (ch_num = 3) -------- */
#define PWM_CMUPD3_CPOLUP                   ( 0x1u << 9 )                       /**< \brief (PWM_CMUPD3) Channel Polarity Update */
#define PWM_CMUPD3_CPOLINVUP                ( 0x1u << 13 )                      /**< \brief (PWM_CMUPD3) Channel Polarity Inversion Update */
/* -------- PWM_ETRG3 : (PWM Offset: 0x46C) PWM External Trigger Register (trg_num = 3) -------- */
#define PWM_ETRG3_MAXCNT_Pos                0
#define PWM_ETRG3_MAXCNT_Msk                ( 0xffffffu << PWM_ETRG3_MAXCNT_Pos ) /**< \brief (PWM_ETRG3) Maximum Counter value */
#define PWM_ETRG3_MAXCNT( value )     ( ( PWM_ETRG3_MAXCNT_Msk & ( ( value ) << PWM_ETRG3_MAXCNT_Pos ) ) )
#define PWM_ETRG3_TRGMODE_Pos               24
#define PWM_ETRG3_TRGMODE_Msk               ( 0x3u << PWM_ETRG3_TRGMODE_Pos ) /**< \brief (PWM_ETRG3) External Trigger Mode */
#define PWM_ETRG3_TRGMODE( value )    ( ( PWM_ETRG3_TRGMODE_Msk & ( ( value ) << PWM_ETRG3_TRGMODE_Pos ) ) )
#define   PWM_ETRG3_TRGMODE_OFF             ( 0x0u << 24 )                    /**< \brief (PWM_ETRG3) External trigger is not enabled. */
#define   PWM_ETRG3_TRGMODE_MODE1           ( 0x1u << 24 )                    /**< \brief (PWM_ETRG3) External PWM Reset Mode */
#define   PWM_ETRG3_TRGMODE_MODE2           ( 0x2u << 24 )                    /**< \brief (PWM_ETRG3) External PWM Start Mode */
#define   PWM_ETRG3_TRGMODE_MODE3           ( 0x3u << 24 )                    /**< \brief (PWM_ETRG3) Cycle-by-cycle Duty Mode */
#define PWM_ETRG3_TRGEDGE                   ( 0x1u << 28 )                    /**< \brief (PWM_ETRG3) Edge Selection */
#define   PWM_ETRG3_TRGEDGE_FALLING_ZERO    ( 0x0u << 28 )                    /**< \brief (PWM_ETRG3) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 */
